/*
문제
땅 위에 달팽이가 있다. 이 달팽이는 높이가 V미터인 나무 막대를 올라갈 것이다.

달팽이는 낮에 A미터 올라갈 수 있다. 하지만, 밤에 잠을 자는 동안 B미터 미끄러진다. 또, 정상에 올라간 후에는 미끄러지지 않는다.

달팽이가 나무 막대를 모두 올라가려면, 며칠이 걸리는지 구하는 프로그램을 작성하시오.

입력
첫째 줄에 세 정수 A, B, V가 공백으로 구분되어서 주어진다. (1 ≤ B < A ≤ V ≤ 1,000,000,000)

출력
첫째 줄에 달팽이가 나무 막대를 모두 올라가는데 며칠이 걸리는지 출력한다.
*/
#include <iostream>
using namespace std;

int main()
{
	// V가 나무 막대의 높이
	// A가 낮에 올라가는 거리
	// B가 밤에 미끄러지는 거리 
	// V,A,B 모두 단위는 m

	int V, A, B;
	cin >> A >> B >> V;

	int distance = 0; // 달팽이가 나무막대를 올라간 거리
	int time = 1; // 달팽이가 나무 막대를 올라가는데 걸린 시간

	while (true)
	{
		distance += A; // 낮에 올라간 거리
		if (distance >= V)
		{
			// 낮 동안 정상에 도착했다면 반복문을 중단 
			break;
		}

		distance -= B; // 밤에 올라간 거리 
		time++;
	}
	cout << time;
	
	return 0;
}

